[
  {
    "id": 1,
    "title": "Booki",
    "description": "Le projet Booki consiste à intégrer une interface web en HTML et CSS pour une start-up proposant des hébergements et activités. En suivant les maquettes fournies, l'objectif est de créer un site responsive et bien structuré en utilisant Flexbox et Grid, tout en respectant les bonnes pratiques d’accessibilité et de validation du code.",
    "image": "/Booki.webp",
    "lien": "https://github.com/Jyrenn/ProjetOC_2",
    "skills": [
      { "id": 1, "name": "HTML", "icon": "/html5.webp" },
      { "id": 2, "name": "CSS", "icon": "/css.webp" }
    ]
  },
  {
    "id": 2,
    "title": "Kasa",
    "description": "Le projet Kasa est une refonte d’un site de location d’appartements, passant d’une vieille base ASP.NET à une stack moderne en React. Ma mission est de développer le front-end à partir de maquettes Figma responsives, en utilisant Vite, React Router et Sass. Les principaux enjeux sont la création de composants réutilisables, la gestion fluide des interactions (carrousel, collapses) et une navigation sans erreur, tout en travaillant sans back-end via des données JSON.",
    "image": "/Kasa.webp",
    "lien": "https://github.com/Jyrenn/Projet_OC5",
    "skills": [
      { "id": 1, "name": "React", "icon": "/react.webp" },
      { "id": 2, "name": "Css", "icon": "/css.webp" },
      { "id": 3, "name": "Sass", "icon": "/sass.webp" },
      { "id": 4, "name": "Vue.js", "icon": "/vuejs.webp" },
      { "id": 5, "name": "Node.js", "icon": "/nodejs.webp" }
    ]
  },
  {
    "id": 3,
    "title": "Mon vieux grimoire",
    "description": "Le projet Mon Vieux Grimoire consiste à développer le back-end d’un site de notation de livres pour une chaîne de librairies lilloise. En collaboration avec un développeur front-end, ma mission est de créer une API sous Node.js, Express et MongoDB, permettant aux utilisateurs d’ajouter des livres, de les noter, et de sécuriser les données via une authentification JWT. J’ai également mis en place l’optimisation des images envoyées par les utilisateurs, tout en respectant les bonnes pratiques du Green Code.",
    "image": "/Grimoire.webp",
    "lien": "https://github.com/Jyrenn/Projet_OC6",
    "skills": [
      { "id": 1, "name": "Express", "icon": "/express.webp" },
      { "id": 2, "name": "Mongodb", "icon": "/mongodb.webp" },
      { "id": 3, "name": "Node.js", "icon": "/nodejs.webp" }
    ]
  }
]
